# GetReinforcementAbbreviationTags Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementSettings..::..GetReinforcementAbbreviationTags Method
ReinforcementSettings Class See Also
---
Gets a list of abbreviation tags for desired reinforcement object type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<ReinforcementAbbreviationTag> GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
```

Visual Basic
---
```text
Public Function GetReinforcementAbbreviationTags ( _
	objectType As ReinforcementAbbreviationObjectType _
) As IList(Of ReinforcementAbbreviationTag)
```

Visual C++
---
```text
public:
IList<ReinforcementAbbreviationTag^>^ GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
```

# ### Parameters
objectType
    Type: Autodesk.Revit.DB.Structure..::..ReinforcementAbbreviationObjectType Defines the type of desired reinforcement object for abbreviation tags.
# ### Return Value
An array of ReinforcementAbbreviationTag that will define all abbreviations for given reinforcement object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace